src/literateclj/journal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-02 Fri 18:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="case" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org64947df">1. 4Clojure Problems</a>
<ul>
<li><a href="#orgccb814e">1.1. #33 Replicate a Sequence</a></li>
<li><a href="#org836bbc8">1.2. #45 Intro to Iterate</a></li>
<li><a href="#org56b0544">1.3. #47 Contain Yourself</a></li>
<li><a href="#org3a244e4">1.4. [[https://www.4clojure.com/problem/31][#31 Pack a Sequence</a></li>
<li><a href="#orgf23b6e8">1.5. #40 Interpose a Sequence</a></li>
<li><a href="#org2e1c9d4">1.6. #41 Drop Every Nth Item</a></li>
</ul>
</li>
<li><a href="#orgf47b8bd">2. SICMutils</a></li>
</ul>
</div>
</div>
<div id="outline-container-org64947df" class="outline-2">
<h2 id="org64947df"><span class="section-number-2">1</span> 4Clojure Problems</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgccb814e" class="outline-3">
<h3 id="orgccb814e"><span class="section-number-3">1.1</span> <a href="https://www.4clojure.com/problem/33">#33 Replicate a Sequence</a></h3>
<div class="outline-text-3" id="text-1-1">
<p>
This initially made me think about the <code>dotimes</code> function however <code>do times</code> takes an n variable and ranges from 0 to n. Instead I used <code>repeat</code> to and <code>take</code> to build a basic understanding of the problem.
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #55b3cc;">(</span>flatten <span style="color: #FFB8D1;">(</span>take <span style="color: #C5A3FF; font-weight: bold;">4</span> <span style="color: #C2FFDF;">(</span>repeat <span style="color: #C5A3FF; font-weight: bold;">4</span> <span style="color: #E6C000;">[</span><span style="color: #C5A3FF;">:a</span><span style="color: #E6C000;">]</span><span style="color: #C2FFDF;">)</span><span style="color: #FFB8D1;">)</span><span style="color: #55b3cc;">)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; (:a :a :a :a)</span>
</pre>
</div>
<p>
One approach could be to map across the entire sequence.
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #55b3cc;">(</span><span style="color: #FFB8D1;">(</span><span style="color: #96CBFE; font-style: italic;">fn</span> <span style="color: #C2FFDF;">[</span>coll n<span style="color: #C2FFDF;">]</span>
  <span style="color: #C2FFDF;">(</span>flatten <span style="color: #E6C000;">(</span>map <span style="color: #C5A3FF;">(</span><span style="color: #96CBFE; font-style: italic;">fn</span> <span style="color: #FFEA00;">[</span>x<span style="color: #FFEA00;">]</span> <span style="color: #FFEA00;">(</span>take n <span style="color: #8295D6;">(</span>repeat n x<span style="color: #8295D6;">)</span><span style="color: #FFEA00;">)</span><span style="color: #C5A3FF;">)</span> coll<span style="color: #E6C000;">)</span><span style="color: #C2FFDF;">)</span><span style="color: #FFB8D1;">)</span> <span style="color: #FFB8D1;">[</span><span style="color: #C5A3FF;">:a</span> <span style="color: #C5A3FF;">:b</span><span style="color: #FFB8D1;">]</span> <span style="color: #C5A3FF; font-weight: bold;">4</span><span style="color: #55b3cc;">)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; (:a :a :a :a :b :b :b :b)</span>
</pre>
</div>
<p>
However it should also be possible to use <code>reduce</code> and perhaps drop the <code>flatten</code> function.
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #55b3cc;">(</span><span style="color: #FFB8D1;">(</span><span style="color: #96CBFE; font-style: italic;">fn</span> <span style="color: #C2FFDF;">[</span>coll n<span style="color: #C2FFDF;">]</span>
  <span style="color: #C2FFDF;">(</span>reduce <span style="color: #E6C000;">(</span><span style="color: #96CBFE; font-style: italic;">fn</span> <span style="color: #C5A3FF;">[</span>f s<span style="color: #C5A3FF;">]</span>
            <span style="color: #C5A3FF;">(</span>apply conj f <span style="color: #FFEA00;">(</span>take n <span style="color: #8295D6;">(</span>repeat n s<span style="color: #8295D6;">)</span><span style="color: #FFEA00;">)</span><span style="color: #C5A3FF;">)</span><span style="color: #E6C000;">)</span>
          <span style="color: #E6C000;">[]</span>
          coll<span style="color: #C2FFDF;">)</span><span style="color: #FFB8D1;">)</span> <span style="color: #FFB8D1;">[</span><span style="color: #C5A3FF;">:a</span> <span style="color: #C5A3FF;">:b</span><span style="color: #FFB8D1;">]</span> <span style="color: #C5A3FF; font-weight: bold;">4</span><span style="color: #55b3cc;">)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; [:a :a :a :a :b :b :b :b]</span>
</pre>
</div>
<p>
The brilliant apply step shown above is referenced from a <a href="https://github.com/morrxy/4clojure/blob/master/problem/33.Replicate%20a%20Sequence.clj">solution</a> online and here it is helpful to see apply as a way to push conj into the the following sequence, e.g. without the apply the output is <code>[(:a :a :a :a) (:b :b :b :b)]</code>, and apply can be seen as applying conj to the inner parens <code>(conj :a :a :a :a)</code> rather than <code>(conj (:a :a :a :a))</code>
In the same link above is the solution <code>(fn [s n] (mapcat (partial repeat n) s))</code> highlights a really perfect use of <code>partial</code> (functional thinking in action!) and introduces me to <code>mapcat</code>. I now wonder if I can apply the <code>partial</code> function to more of my solutions as a way of practicing a kind of encapsulation without writing separate helper functions (a kind of internal encapsulation).
</p>
</div>
</div>
