src/literateclj/journal.html
<div id="outline-container-org836bbc8" class="outline-3">
<h3 id="org836bbc8"><span class="section-number-3">1.2</span> <a href="https://www.4clojure.com/problem/45">#45 Intro to Iterate</a></h3>
<div class="outline-text-3" id="text-1-2">
<p>
What I thought iterate would output is <code>(4 4 4 4 4)</code>, that is, just taking the function and making an infinite sequence out of it. What it actually outputs is <code>(1 4 7 10 13)</code> which is x, f(x), f(f(x), f(f(f(x))), etc. This very much looks like a versatile variation of <code>reduce</code> and I wonder if previous examples could be solved with it (for example #33 Replicate a sequence).
A quick first attempt to see what iterate would look like gives me the impression that since iterate returns the first input as a result that this will either have to be stripped away, buuuut it does make me think of the fibonacci sequence where the initial values are a good candidate for the output
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #55b3cc;">(</span>take <span style="color: #C5A3FF; font-weight: bold;">5</span> <span style="color: #FFB8D1;">(</span>iterate #<span style="color: #C2FFDF;">(</span>+ <span style="color: #C5A3FF; font-weight: bold;">3</span> <span style="color: #FFB8D1;">%</span><span style="color: #C2FFDF;">)</span> <span style="color: #C5A3FF; font-weight: bold;">1</span><span style="color: #FFB8D1;">)</span><span style="color: #55b3cc;">)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; (1 4 7 10 13)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #55b3cc;">(</span>take <span style="color: #C5A3FF; font-weight: bold;">2</span> <span style="color: #FFB8D1;">(</span>iterate #<span style="color: #C2FFDF;">(</span>repeat <span style="color: #C5A3FF; font-weight: bold;">4</span> <span style="color: #FFB8D1;">%</span><span style="color: #C2FFDF;">)</span> <span style="color: #C2FFDF;">[</span><span style="color: #C5A3FF;">:a</span> <span style="color: #C5A3FF;">:b</span><span style="color: #C2FFDF;">]</span><span style="color: #FFB8D1;">)</span><span style="color: #55b3cc;">)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; ([:a :b] ([:a :b] [:a :b] [:a :b] [:a :b]))</span>

<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">fib attempt</span>
<span style="color: #55b3cc;">(</span>take <span style="color: #C5A3FF; font-weight: bold;">5</span> <span style="color: #FFB8D1;">(</span>iterate #<span style="color: #C2FFDF;">(</span>+ <span style="color: #FFB8D1;">%</span> <span style="color: #FFB8D1;">%</span><span style="color: #C2FFDF;">)</span> <span style="color: #C5A3FF; font-weight: bold;">1</span><span style="color: #FFB8D1;">)</span><span style="color: #55b3cc;">)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; (1 2 4 8 16)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; (1 2 3 4 5)</span>

<span style="color: #55b3cc;">(</span>#<span style="color: #FFB8D1;">(</span>take <span style="color: #FFB8D1;">%</span> <span style="color: #C2FFDF;">(</span>iterate <span style="color: #E6C000;">(</span><span style="color: #96CBFE; font-style: italic;">fn</span> <span style="color: #C5A3FF;">[</span><span style="color: #FFEA00;">[</span>a b<span style="color: #FFEA00;">]</span><span style="color: #C5A3FF;">]</span> <span style="color: #C5A3FF;">[</span>b <span style="color: #FFEA00;">(</span>+ a b<span style="color: #FFEA00;">)</span><span style="color: #C5A3FF;">]</span><span style="color: #E6C000;">)</span> <span style="color: #E6C000;">[</span><span style="color: #C5A3FF; font-weight: bold;">1</span> <span style="color: #C5A3FF; font-weight: bold;">1</span><span style="color: #E6C000;">]</span><span style="color: #C2FFDF;">)</span><span style="color: #FFB8D1;">)</span> <span style="color: #C5A3FF; font-weight: bold;">8</span><span style="color: #55b3cc;">)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; ([1 1] [1 2] [2 3] [3 5] [5 8] [8 13] [13 21] [21 34])</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; (1 1 2 3 5 8 13 21) after adding map first</span>

<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">first I don't think I understand the destructuring</span>
<span style="color: #55b3cc;">(</span><span style="color: #96CBFE; font-style: italic;">let</span> <span style="color: #FFB8D1;">[</span><span style="color: #C2FFDF;">[</span>a b<span style="color: #C2FFDF;">]</span> <span style="color: #C2FFDF;">[</span><span style="color: #C5A3FF; font-weight: bold;">1</span> <span style="color: #C5A3FF; font-weight: bold;">3</span><span style="color: #C2FFDF;">]</span><span style="color: #FFB8D1;">]</span>
   <span style="color: #FFB8D1;">(</span>str a <span style="color: #FFEA00;">" "</span> b<span style="color: #FFB8D1;">)</span><span style="color: #55b3cc;">)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; "1 3"</span>
</pre>
</div>
<p>
   This keeps catching me out, when a vector is destructured to a vector the values are mapped to corresponding variable names so the above fib variation with iterate looks like return the vector that consists of the second input variable as the first result and the second result is the first input plus the second input, then feed that resulting vector into the same function so [1 1] -&gt; [1 2] -&gt; [2 3] -&gt; [3 5] -&gt; [5 8]
I suppose the discover fiction might have gone like:
</p>
<ol class="org-ol">
<li>first think about explaining exactly what the fib sequence is doing and pretend that there is a way to feed outputs of functions back to themselves iteratively.</li>
<li>then somehow one has to know that the iterate function is exactly what fits that imagined patter (of course pure recursion is probably the simpler approach) but given that iterate does exist then map first through that generated sequence.
For the discovery process to work it's important to think like feynman when he says It's ok not to know everything. Just move forward with the abstraction and take note of where you are stuck, the mind will create a kind of sieve that will make the solution pop out eventually!</li>
</ol>
</div>
</div>
<div id="outline-container-org56b0544" class="outline-3">
<h3 id="org56b0544"><span class="section-number-3">1.3</span> <a href="https://www.4clojure.com/problem/47">#47 Contain Yourself</a></h3>
<div class="outline-text-3" id="text-1-3">
<p>
Using <code>contains?</code> on an indexed sequence takes the second argument to literally mean is index n in the sequence. However when used on a map or a map-like structure then <code>contains?</code> looks to see if the KEY is in the collection. Fun fact, I did not know until this exercise that a set is a map-like collection  but this makes sense to me in that a set can be thought of as a collection of keys, so key comparisons in <code>contains</code> returns true if key is in set.
</p>
</div>
</div>
<div id="outline-container-org3a244e4" class="outline-3">
<h3 id="org3a244e4"><span class="section-number-3">1.4</span> [[<a href="https://www.4clojure.com/problem/31">https://www.4clojure.com/problem/31</a>][#31 Pack a Sequence</h3>
<div class="outline-text-3" id="text-1-4">
<p>
   ]]Pack consecutive duplicates into sub-lists
This was so simple since I've had some experience with partition-by in the past. It's a good example of when the <code>identity</code> function is valuable (hard to imagine when just coming across it for the first time!)
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #55b3cc;">(</span>partition-by identity <span style="color: #FFB8D1;">[</span><span style="color: #C5A3FF; font-weight: bold;">1</span> <span style="color: #C5A3FF; font-weight: bold;">1</span> <span style="color: #C5A3FF; font-weight: bold;">2</span> <span style="color: #C5A3FF; font-weight: bold;">1</span> <span style="color: #C5A3FF; font-weight: bold;">1</span> <span style="color: #C5A3FF; font-weight: bold;">1</span> <span style="color: #C5A3FF; font-weight: bold;">3</span> <span style="color: #C5A3FF; font-weight: bold;">3</span><span style="color: #FFB8D1;">]</span><span style="color: #55b3cc;">)</span>
</pre>
</div>
</div>
</div>
