src/literateclj/journal.html
<div id="outline-container-orgf23b6e8" class="outline-3">
<h3 id="orgf23b6e8"><span class="section-number-3">1.5</span> <a href="https://www.4clojure.com/problem/40">#40 Interpose a Sequence</a></h3>
<div class="outline-text-3" id="text-1-5">
<p>
Without the function interpose, here is my first attempt. Still some effort involved to remember that any time I see a function applied to each index in a seq then the first thought should be map. This seems like there could be a more elegant solution, in particular I'm not fond of the <code>flatten</code> seems like there could be a simpler answer
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #55b3cc;">(</span><span style="color: #FFB8D1;">(</span><span style="color: #96CBFE; font-style: italic;">fn</span> <span style="color: #C2FFDF;">[</span>v coll<span style="color: #C2FFDF;">]</span>
   <span style="color: #C2FFDF;">(</span>flatten <span style="color: #E6C000;">(</span>map <span style="color: #C5A3FF;">(</span><span style="color: #96CBFE; font-style: italic;">fn</span> <span style="color: #FFEA00;">[</span>x<span style="color: #FFEA00;">]</span> <span style="color: #FFEA00;">(</span>conj <span style="color: #8295D6;">[]</span> x v<span style="color: #FFEA00;">)</span><span style="color: #C5A3FF;">)</span> coll<span style="color: #E6C000;">)</span><span style="color: #C2FFDF;">)</span> <span style="color: #FFB8D1;">)</span> <span style="color: #C5A3FF;">:z</span> <span style="color: #FFB8D1;">[</span><span style="color: #C5A3FF;">:a</span> <span style="color: #C5A3FF;">:b</span> <span style="color: #C5A3FF;">:c</span> <span style="color: #C5A3FF;">:d</span><span style="color: #FFB8D1;">]</span><span style="color: #55b3cc;">)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; (:a :z :b :z :c :z :d :z)</span>
</pre>
</div>
<p>
&#x2026;on closer inspection it seems like I got this one wrong, the last term should not be added, so the problem is to add something within the range of the collection&#x2026;hmmm
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #55b3cc;">(</span><span style="color: #FFB8D1;">(</span><span style="color: #96CBFE; font-style: italic;">fn</span> <span style="color: #C2FFDF;">[</span>v coll<span style="color: #C2FFDF;">]</span>
   <span style="color: #C2FFDF;">(</span>butlast <span style="color: #E6C000;">(</span>flatten <span style="color: #C5A3FF;">(</span>map <span style="color: #FFEA00;">(</span><span style="color: #96CBFE; font-style: italic;">fn</span> <span style="color: #8295D6;">[</span>x<span style="color: #8295D6;">]</span> <span style="color: #8295D6;">(</span>conj <span style="color: #a2b6da;">[]</span> x v<span style="color: #8295D6;">)</span><span style="color: #FFEA00;">)</span> coll<span style="color: #C5A3FF;">)</span><span style="color: #E6C000;">)</span><span style="color: #C2FFDF;">)</span><span style="color: #FFB8D1;">)</span> <span style="color: #C5A3FF; font-weight: bold;">0</span> <span style="color: #FFB8D1;">[</span><span style="color: #C5A3FF; font-weight: bold;">1</span> <span style="color: #C5A3FF; font-weight: bold;">2</span> <span style="color: #C5A3FF; font-weight: bold;">3</span><span style="color: #FFB8D1;">]</span><span style="color: #55b3cc;">)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; (1 0 2 0 3)</span>
</pre>
</div>
<p>
&#x2026;so now I am definitely suspicious that this is not as elegant as is possible so lets look at some other solutions to learn from them. Looks like I'm not alone in my approach but two other approaches interest me in that they introduce <code>interleave</code> and also use <code>reduce</code> (which is also seems like a pattern, anything map can do reduce can do better!). Looking at reduce first:
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #E6C000;">;; </span><span style="color: #E6C000;">reduce here is using an accumulator which is a common pattern</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">lets start with the naive implementation</span>
<span style="color: #55b3cc;">(</span>reduce <span style="color: #FFB8D1;">(</span><span style="color: #96CBFE; font-style: italic;">fn</span> <span style="color: #C2FFDF;">[</span>acc x<span style="color: #C2FFDF;">]</span> <span style="color: #C2FFDF;">(</span>conj acc x <span style="color: #C5A3FF; font-weight: bold;">0</span><span style="color: #C2FFDF;">)</span><span style="color: #FFB8D1;">)</span>
        <span style="color: #FFB8D1;">[]</span>
        <span style="color: #FFB8D1;">[</span><span style="color: #C5A3FF; font-weight: bold;">1</span> <span style="color: #C5A3FF; font-weight: bold;">2</span> <span style="color: #C5A3FF; font-weight: bold;">3</span><span style="color: #FFB8D1;">]</span><span style="color: #55b3cc;">)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; [1 0 2 0 3 0]</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">so we can get rid of the flatten with reduce however</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">it does look like we're stuck with either droplast or butlast</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">Other solutions show us how to drop the flatten with mapcat</span>
<span style="color: #55b3cc;">(</span>mapcat <span style="color: #FFB8D1;">(</span><span style="color: #96CBFE; font-style: italic;">fn</span> <span style="color: #C2FFDF;">[</span>x<span style="color: #C2FFDF;">]</span> <span style="color: #C2FFDF;">(</span>list x <span style="color: #C5A3FF; font-weight: bold;">0</span><span style="color: #C2FFDF;">)</span><span style="color: #FFB8D1;">)</span> <span style="color: #FFB8D1;">[</span><span style="color: #C5A3FF; font-weight: bold;">1</span> <span style="color: #C5A3FF; font-weight: bold;">2</span> <span style="color: #C5A3FF; font-weight: bold;">3</span><span style="color: #FFB8D1;">]</span><span style="color: #55b3cc;">)</span><span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; (1 0 2 0 3 0)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">this is a good example of getting rid of flatten and still</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">keeping the simplicity of map but also it's nice to note that</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">the list function is a very simple way to make two things that</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">are not a collection into a list collection, this should be the</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">goto instead of fidgeting around with cons, conj, and into...</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">finally let's look at interleave</span>
<span style="color: #55b3cc;">(</span>#<span style="color: #FFB8D1;">(</span>interleave <span style="color: #FFB8D1;">%</span> <span style="color: #C2FFDF;">(</span>repeat <span style="color: #C5A3FF; font-weight: bold;">0</span><span style="color: #C2FFDF;">)</span><span style="color: #FFB8D1;">)</span> <span style="color: #FFB8D1;">[</span><span style="color: #C5A3FF; font-weight: bold;">1</span> <span style="color: #C5A3FF; font-weight: bold;">2</span> <span style="color: #C5A3FF; font-weight: bold;">3</span><span style="color: #FFB8D1;">]</span><span style="color: #55b3cc;">)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; (1 0 2 0 3 0)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">I really like this solution because the concept of using</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">repeat as a generative collection that simply produces a result as</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">they are needed seems succinct and powerful. It's also a way of thinking</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">that is foreign to me and so using it and seeing it really helps imagine</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">concrete use cases (or rather I believe it will make me more likely to apply</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">it in the future!)</span>
</pre>
</div>
</div>
</div>
