src/literateclj/journal.html

<div id="outline-container-org2e1c9d4" class="outline-3">
<h3 id="org2e1c9d4"><span class="section-number-3">1.6</span> <a href="https://www.4clojure.com/problem/41">#41 Drop Every Nth Item</a></h3>
<div class="outline-text-3" id="text-1-6">
<p>
Given coll and N drop ever N from coll
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #55b3cc;">(</span><span style="color: #96CBFE; font-style: italic;">def</span> <span style="color: #FFB8D1;">coll</span> <span style="color: #FFB8D1;">[</span><span style="color: #C5A3FF; font-weight: bold;">1</span> <span style="color: #C5A3FF; font-weight: bold;">2</span> <span style="color: #C5A3FF; font-weight: bold;">3</span> <span style="color: #C5A3FF; font-weight: bold;">4</span> <span style="color: #C5A3FF; font-weight: bold;">5</span> <span style="color: #C5A3FF; font-weight: bold;">6</span> <span style="color: #C5A3FF; font-weight: bold;">7</span> <span style="color: #C5A3FF; font-weight: bold;">8</span><span style="color: #FFB8D1;">]</span><span style="color: #55b3cc;">)</span>
<span style="color: #55b3cc;">(</span>partition <span style="color: #C5A3FF; font-weight: bold;">3</span> coll<span style="color: #55b3cc;">)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; ((1 2 3) (4 5 6))</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">oops this drops the last group if it is smaller than 3!</span>
<span style="color: #55b3cc;">(</span>partition-all <span style="color: #C5A3FF; font-weight: bold;">3</span> coll<span style="color: #55b3cc;">)</span><span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; ((1 2 3) (4 5 6) (7 8))</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">partition-all gives us the remaining partition even if it's size is too</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">small but we need to uniformly apply butlast to all so we need to pad instead</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">partition takes a n items, a step size which usually defaults to n, a padding</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">which here we use the vector of zero arbitrarily and the collection! perfect!</span>
<span style="color: #55b3cc;">(</span>partition <span style="color: #C5A3FF; font-weight: bold;">3</span> <span style="color: #C5A3FF; font-weight: bold;">3</span> <span style="color: #FFB8D1;">[</span><span style="color: #C5A3FF; font-weight: bold;">0</span><span style="color: #FFB8D1;">]</span> coll<span style="color: #55b3cc;">)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; ((1 2 3) (4 5 6) (7 8 0))</span>
<span style="color: #55b3cc;">(</span><span style="color: #FFB8D1;">(</span><span style="color: #96CBFE; font-style: italic;">fn</span> <span style="color: #C2FFDF;">[</span>c n<span style="color: #C2FFDF;">]</span>
   <span style="color: #C2FFDF;">(</span>mapcat butlast <span style="color: #E6C000;">(</span>partition n n <span style="color: #C5A3FF;">[</span><span style="color: #C5A3FF; font-weight: bold;">0</span><span style="color: #C5A3FF;">]</span> c<span style="color: #E6C000;">)</span><span style="color: #C2FFDF;">)</span><span style="color: #FFB8D1;">)</span> coll <span style="color: #C5A3FF; font-weight: bold;">3</span><span style="color: #55b3cc;">)</span><span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; (1 2 4 5 7 8)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">I bet there is a way to use reduce</span>
<span style="color: #55b3cc;">(</span><span style="color: #FFB8D1;">(</span><span style="color: #96CBFE; font-style: italic;">fn</span> <span style="color: #C2FFDF;">[</span>c n<span style="color: #C2FFDF;">]</span>
   <span style="color: #C2FFDF;">(</span>reduce <span style="color: #E6C000;">(</span><span style="color: #96CBFE; font-style: italic;">fn</span> <span style="color: #C5A3FF;">[</span>acc x<span style="color: #C5A3FF;">]</span> <span style="color: #C5A3FF;">(</span>apply conj acc <span style="color: #FFEA00;">(</span>butlast x<span style="color: #FFEA00;">)</span><span style="color: #C5A3FF;">)</span><span style="color: #E6C000;">)</span>
           <span style="color: #E6C000;">[]</span>
           <span style="color: #E6C000;">(</span>partition n n <span style="color: #C5A3FF;">[</span><span style="color: #C5A3FF; font-weight: bold;">0</span><span style="color: #C5A3FF;">]</span> c<span style="color: #E6C000;">)</span><span style="color: #C2FFDF;">)</span><span style="color: #FFB8D1;">)</span> coll <span style="color: #C5A3FF; font-weight: bold;">3</span><span style="color: #55b3cc;">)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; [(1 2) (4 5) (7 8)] &lt;-- solution before adding apply</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; [1 2 4 5 7 8]</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">this is so cool because not only is this an alternate solution</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">using reduce, it also applies the apply logic to push the conj</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">into the group so that there is no need for a flatten!</span>
</pre>
</div>
<p>
There are a few other solutions that warrant a closer look:
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #E6C000;">;; </span><span style="color: #E6C000;">keep is like map where nil results are filtered from the final answer</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">keep-indexed is like map-indexed where nil results are filtered and f</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">requires both an index and a value</span>
<span style="color: #55b3cc;">(</span><span style="color: #FFB8D1;">(</span><span style="color: #96CBFE; font-style: italic;">fn</span> <span style="color: #C2FFDF;">[</span>c n<span style="color: #C2FFDF;">]</span>
   <span style="color: #C2FFDF;">(</span>keep-indexed <span style="color: #E6C000;">;; </span><span style="color: #E6C000;">so %1 and %2 below are idx and item of the coll</span>
     #<span style="color: #E6C000;">(</span><span style="color: #96CBFE; font-style: italic;">if</span> <span style="color: #C5A3FF;">(</span>&gt; <span style="color: #FFEA00;">(</span>mod <span style="color: #8295D6;">(</span>inc <span style="color: #FFB8D1;">%1</span><span style="color: #8295D6;">)</span> n<span style="color: #FFEA00;">)</span> <span style="color: #C5A3FF; font-weight: bold;">0</span><span style="color: #C5A3FF;">)</span> <span style="color: #FFB8D1;">%2</span><span style="color: #E6C000;">)</span> c<span style="color: #C2FFDF;">)</span><span style="color: #FFB8D1;">)</span>
 coll <span style="color: #C5A3FF; font-weight: bold;">3</span><span style="color: #55b3cc;">)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; (1 2 4 5 7 8)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">if mod is &gt; 0 keep the value in the list, so in this example every 3rd</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">item is kept and the rest are thrown out! A poor mans partition!</span>

<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">the partition-all solution is rather elegant as well</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">partition-all takes a partition size n, a step and a coll</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">partition-all keeps chunks that are smaller than the partition size</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">unlike partition-by which is "wasteful" and drops the extra</span>
<span style="color: #55b3cc;">(</span>partition-all <span style="color: #FFB8D1;">(</span>dec <span style="color: #C5A3FF; font-weight: bold;">3</span><span style="color: #FFB8D1;">)</span> <span style="color: #C5A3FF; font-weight: bold;">3</span> coll<span style="color: #55b3cc;">)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; ((1 2) (4 5) (7 8))</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">then apply concat slides into the groupings and stitches it all</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">back into a flat seq</span>
<span style="color: #55b3cc;">(</span>apply concat <span style="color: #FFB8D1;">(</span>partition-all <span style="color: #C2FFDF;">(</span>dec <span style="color: #C5A3FF; font-weight: bold;">3</span><span style="color: #C2FFDF;">)</span> <span style="color: #C5A3FF; font-weight: bold;">3</span> coll<span style="color: #FFB8D1;">)</span><span style="color: #55b3cc;">)</span><span style="color: #E6C000;">;; </span><span style="color: #E6C000;">=&gt; (1 2 4 5 7 8)</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">i think the key piece is that partition size is 2 for this example</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">and step size is 3 so partion-all steps over the last item effectively</span>
<span style="color: #E6C000;">;; </span><span style="color: #E6C000;">dropping it!</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgf47b8bd" class="outline-2">
<h2 id="orgf47b8bd"><span class="section-number-2">2</span> SICMutils</h2>
<div class="outline-text-2" id="text-2">
<p>
**
</p>
<div class="org-src-container">
<pre class="src src-clojure">
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: case</p>
<p class="date">Created: 2021-04-02 Fri 18:27</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
